from sys import stdin

stdin = open("14500.txt")

n, m = map(int, stdin.readline().split())

print(n, m)

board = [list(map(int, stdin.readline().split())) for _ in range(n)]

print(board)

tetromino = [
    [[0,0],[0,1],[0,2],[0,3]], #-
    [[0,0],[1,0],[2,0],[3,0]], #ㅣ
    [[0,0],[0,1],[1,0],[1,1]], #ㅁ
    [[0,0],[0,1],[0,2],[1,0]], #ㄱ
    [[0,0],[0,1],[0,2],[1,2]],
    [[0,0],[1,0],[1,1],[1,2]],
    [[0,2],[1,2],[1,1],[1,0]],
    [[0,1],[0,0],[1,0],[2,0]],
    [[0,0],[0,1],[1,1],[2,1]],
    [[0,0],[1,0],[2,0],[2,1]],
    [[0,1],[1,1],[2,1],[2,0]],
    [[0,0],[0,1],[0,2],[1,1]], #ㅜ
    [[0,1],[1,0],[1,1],[1,2]],
    [[0,0],[1,0],[1,1],[2,0]],
    [[1,0],[0,1],[1,1],[2,1]],
    [[0,1],[1,1],[1,0],[2,0]],
    [[0,0],[1,0],[1,1],[2,1]],
    [[0,1],[0,2],[1,1],[1,0]],
    [[0,0],[0,1],[1,1],[1,2]]
]


result = 0

for x in range(n):
    for y in range(m):
        for k in tetromino: # 모든 좌표를 순회하며 도형 하나씩 그려본다
            try:
                a = board[x + k[0][0]][y + k[0][1]]
                b = board[x + k[1][0]][y + k[1][1]]
                c = board[x + k[2][0]][y + k[2][1]]
                d = board[x + k[3][0]][y + k[3][1]]
                temp = a + b + c + d
            except:
                temp = 0
            result = max(result, temp)

print(result)